---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.CannotGenerateRamp
source: html/75ec6239-fd89-118f-f754-80d7b825c666.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.CannotGenerateRamp Property

Couldn't generate surfaces for ramp.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotGenerateRamp { get; }
```